package com.jainpuja.androidmusicplayer_ver2;

import android.app.Activity;
import android.content.Intent;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.AdapterView.OnItemClickListener;
import android.widget.Button;
import android.widget.ListView;
import android.widget.TextView;

import java.util.ArrayList;
import java.util.HashMap;


public class Jinwani extends Activity implements OnItemClickListener
{
    static String KEY_DESC,KEY_NAME,KEY_COST;
    public TextView title;
    ListView jinwani;
    ListViewCustomAdapter adapter;
    String [] headings  = {"Page Name","देवदर्शन-स्वाध्याय :विधि-निर्देश","अभिषेक : विधि-निर्देश","स्वस्तिक : उद्देश्य एवं भावना","पूजन  : विधि-निर्देश","जैन दर्शन का उद्देश्य","मण्डलाष्टकम् (संस्कृत)","मंगलाष्टक-स्तुति (हिंदी)","दर्शनपाठ (तुम निरखत...)","स्तुति (प्रभु पतितपावन)","जलाभिषेक पाठ","प्रतिमा-प्रक्षाल-विधि  पाठ","अभिषेक पाठ :(संस्कृत)","विनयपाठ (इह बिधि ठाड़ो...)","मंगलपाठ (मंगलमूर्ति परमपद...)","भजन (श्री जी! मैं थानेपूजन...)","पूजा-विधि प्रारम्भ","पंचकल्याणकअर्घ्य","स्वस्ति-मंगल-विधा(संस्कृत)","चतुर्विंशति स्वस्ति-मंगलम्(संस्कृत)","परमर्षि-स्वस्ति-विधान (संस्कृत)","देव-शास्त्र-गुरु पूजा (द्यानतराय)","तीस चौबीसी का अर्घ्य","श्री बीस तीर्थंकर पूजा (द्यानतराय)","विद्यमान बीस तीर्थंकरों के अर्घ्य","अकृत्रिम चैत्यालय-वंदना (संस्कृत)","चैत्य-भक्त्ति","सिद्ध-पूजा (संस्कृत-पद् मनन्दि)","सिद्ध-पूजा (भावाष्टक-द्रव्याष्टक)","सिद्ध-पूजा (द्रव्याष्टक-हीराचंद)","समुच्चय चौबीसी पूजा (वृन्दावन)","श्री आदिनाथ-जिन पूजा 'जिनेश्वर'","श्री शांतिनाथ पूजा (बख्तावर)","श्री पार्श्वनाथ पूजा (बख्तावर)","श्री महावीर-जिन पूजा(वृन्दावन)","समुच्चय महाअर्घ्य","आसिका लेने का पद","शांतिपाठ(शास्त्रोक्तविधि...)","विसर्जनपाठ(सम्पूर्णविधि)","स्तुति (तुम तरण तारण)","स्तुति (मै तुमचरण)","भजन (आ. देवेन्द्रकीर्ति)","समुच्चय-पूजा (सच्चिदानंद)","श्री देव-शास्त्र-गुरु पूजा (युगल जी)","श्री देव-शास्त्र-गुरु पूजा (रवीन्द्र)","श्री आदिनाथ पूजा (चाँदखेड़ी)","श्री ऋषभदेव पूजा (रानीला)","श्री पदमप्रभ पूजा (बाड़ा)","श्री चंद्रप्रभ पूजा (तिजारा)","श्री नेमिनाथ पूजा (सन्मति)","श्री पार्श्वनाथ पूजा (पुष्पेन्दु)","श्री पार्श्वनाथपूजा (रवीन्द्र)","श्री पार्श्वनाथ पूजा (बड़ागॉव)","श्री महावीर पूजा (चाँदनगॉव)","भजन (चाँदनपुर के महावीर)","श्री महावीर पूजा (भारिल्ल)","नवदेवता-पूजन (ज्ञानमती)","श्री पंच परमेष्ठी पूजा (राजमल)","सिद्ध-पूजा (युगल जी)","श्री बाहुबलीस्वामी पूजा (अरुणा)","श्री जम्बूस्वामी पूजा (स्वस्तिभूषण)","आ. कुंदकुंदस्वामी पूजा(अरुणा)","श्री अकंपनाचार्यादि पूजा","श्री विष्णुकुमार मुनि पूजा","सोलहकरण भावना पूजा (द्यानत)","पंचमेरू पूजा (द्यानतराय)","नंदीश्वर द्वीप पूजा (द्यानतराय)","दशलक्षण धर्म पूजा(द्यानतराय)","रत्नत्रय पूजा (द्यानतराय)","सम्यग्दर्शन पूजा (द्यानतराय)","सम्यग्ज्ञान पूजा (द्यानतराय)","सम्यक्चारित्र पूजा (द्यानतराय)","स्वयंभुस्तोत्र (भाषा) (द्यानतराय)","क्षमावणी- पर्व पूजा (मल्लजी)","अकृत्रिम-चैत्यालयपूजा (नेमजी)","सप्तर्षि पूजा (मनरंगलाल)","चौबीसी निर्वाणक्षेत्र पूजा (द्यानत)","पंचबालयति पूजा (अरदास)निर्वाणक्षेत्र बड़ी पूजा ","(निर्वाण लड्डू पूजा)","श्रीऋषिमंडल पूजा (दौलत आसेरी)","रविव्रत पूजा","समुच्चय पूजा","नवग्रह अरिष्ट-निवारक विधान","उपसर्ग हर स्तोत्र (भद्रबाहु)","नवग्रह-शांति स्तोत्रम् (संस्कृत)","नवग्रह-शांति स्तोत्र (हिंदी)","नवगृहों के जाप्य","श्री कलिकुंड-पार्श्वनाथ पूजा ","अहिच्छत्र श्रीपार्श्वनाथ पूजा","दीपावली-पूजन-विधान","नई बहियों कि मुहूर्त-विथि","सरस्वती पूजा (द्यानतराय)","सरस्वती स्तवन","गौतमस्वामी जी का अर्घ्य","अंतराय-नाशार्थ अर्घ्य","लाभ शुभ","शांति-पाठ (संस्कृत)","विसर्जन-पाठ (संस्कृत)","अथ इष्ट-प्रार्थना","शांति पाठ (हिंदी)","विसर्जन-पाठ (हिंदी)","वीर-प्रभु जी आरती","गौतम गणधरदेव पूजा (अरुणा)","निर्वाण-कांड (हिंदी-भगवती)","श्रुतपंचमी पूजा (अरुणा)","णमोकार महामंत्र पूजा (ज्ञानमती)","चौबीसी पूजा स्तवन","श्री ऋषभनाथ पूजा","श्री अजितनाथ पूजा","श्री संभवनाथ पूजा","श्री अभिनंदननाथ पूजा","श्री सुमतिनाथ पूजा","श्री पद्मप्रभ पूजा","श्री सुपार्श्वनाथ पूजा","श्री चंद्रप्रभ पूजा","श्री पुष्पदंत पूजा","श्री शीतलनाथ पूजा","श्री श्रेयांसनाथ पूजा","श्री वासुपूज्य पूजा","श्री विमलनाथ पूजा","श्री अनंतनाथ पूजा","श्री धर्मनाथ पूजा","श्री शांतिनाथ पूजा ","श्री कुंथुनाथपूजा","श्री अरहनाथ पूजा","श्री मल्लिनाथ पूजा","श्री मुनिसुव्रतनाथ पूजा","श्री नमिनाथ पूजा","श्री नेमिनाथपूजा","श्री पार्श्वनाथ पूजा","श्री जिनसहस्रनाम-स्तोत्रम्(स)","श्री ऋषिमंडल स्तोत्रम् (संस्कृत)","तत्त्वार्थसूत्र : मोक्षशास्त्र (संस्कृत)","भक्तामर-स्तोत्रम्(संस्कृत)","भक्तामर-स्तोत्र महिमा","भक्तामर-स्तोत्र (हिंदी, हेमराज)","महावीराष्टक- स्तोत्रम्(संस्कृत)","तीर्थंकर महावीर महत्त्वपूर्ण संदर्भ","कल्याणमंदिर-स्तोत्र (हिंदी)","एकीभाव-स्तोत्र (हिंदी)","विषापहार-स्तोत्र (हिंदी)","मंगल प्रभात स्तवन","भुपालचतुर्विंशति-स्तोत्र (हिंदी)","रत्नाकर-पंचविंशतिका","सामायिक-पाठ (नितदेव! मेरी","आलोचना-पाठ (सुनिये जिन!","सामायिक-पाठ (काल-अनंत","बारह भावना (वंदूँ श्री अरिहंत","बारह भावना (राजा राणा छत्र","मेरी भावना (जिसने राग-द्वेष","वैराग्य भावना (इहविधि राज","समाधि भावना (दिन-रात मेरे","लघु समाधिमरण-पाठ","अथ अठाई रासा (विनयकीर्ति)","तिथि षोडशी पाठ (द्यानतराय)","संकटमोचन विनती (हे दीनबंधु","दुःखहरण विनती (श्रीपति जिन.","गुरु-स्तुति (ते गुरु मेरे","दर्शन-पाठ (दौलतराम)","देव-स्तुति (भूधरदास)","आराधना-पाठ (द्यानतराय)","श्री पार्श्वनाथस्तोत्रम्(नरेंद्र","आत्म कीर्तन (हूँ स्वतन्त्र","इस्ट प्रार्थना (भावना दिन","संबोधन (सदा संतोष कर","आत्म-रमण (मैं  दर्शन","आत्म-भक्ति (मेरे शाश्वत","श्रीसिद्धचक्र कि आरती","स्तुति (श्री सिद्धचक्र का पाठ"," स्तुति पाश्र्वनाथ (तुमसे लागी)","शास्त्र-स्वाध्याय-मंगलाचरण","जिनवाणी-स्तुति (वीर हीमा.)","श्री आदिनाथ चालीसा (चांदखेड़ी)","श्री पद्मप्रभ चालीसा","श्री चंद्रप्रभ चालीसा","श्री मुनिसुव्रतनाथ चालीसा","श्री पार्श्वनाथ चालीसा (बड़ागांव)","श्री पार्श्वनाथ चालीसा (अहिच्छात्र)","श्री महावीर चालीसा","रस त्याग विचार","आरती: शब्दार्थ और व्याख्या","श्री पंच-परमेष्ठी (इहविधि...)","आरती: श्री जिनराजतिहारी ","आरती: श्री चौबीस भगवान्","आरती: श्री आदिनाथ भगवान् ","आरती: श्री चंद्रप्रभ","आरती :श्री मुनिसुव्रतनाथ","आरती :श्री पार्श्वनाथ","आरती:श्री पार्श्वनाथ (बड़ागांव)","आरती श्री वर्द्धमान","आरती :श्री महावीर (चाँदनपुर)","आरती :श्री महावीर स्वामी","सम्मेदशिखर वंदना-क्रम","प्रमुख तीर्थक्षेत्र-परिचय","प्रमुख जैन-पर्व","वृहत् शांतिधारा-पाठ","सिद्ध क्षेत्रों की अर्घ्यावली","समस्त पूजा-अर्घ्यावली","जाप्य-मंत्र सूची","भक्षय- अभक्षय","फल-सब्जी :जैन-सूची","'श्रावक प्रतिक्रमण' क्या है?","श्रावक-प्रतिक्रमण(लघु)","पंच-कल्याणक-तिथियाँ","पंच-कल्याणक-तिथि चार्ट","दिशाशूल-विचार","सूतक-अवथि-विचार","चैत्य-चैत्यालय-निर्माण : वास्तु","ग्यारह प्रतिमाव्रत क्रम","स्लेखखना का स्वरुप"};
    String [] pages = {"Page No.","19","23","26","27","32","33","37","40","43","55","58","63","67","69","70","71","73","74","76","77","85","90","90","94","94","97","99","109","111","117","121","127","133","139","145","146","147","148","149","150","151","152","156","161","165","171","179","184","190","196","202","206","210","217","219","224","229","233","238","243","248","252","256","261","269","273","278","285","286","288","290","294","297","302","307","312","316","321","334","344","349","355","356","358","359","360","361","367","374","375","378","382","383","383","384","385","386","386","387","390","391","392","396","398","402","408","410","414","419","424","430","435","440","445","453","458","463","468","473","477","482","487","492","497","502","507","512","516","521","525","540","546","560","569","570","577","580","581","586","591","599","600","606","611","617","621","627","632","634","636","639","640","642","647","649","656","659","661","663","664","666","667","667","668","668","669","670","671","673","674","676","677","679","681","683","685","689","691","693","694","694","695","695","696","696","697","698","699","699","700","701","702","703","710","711","714","720","731","735","737","737","738","740","743","745","745","746","749","750"};
    String [] pics = {"pic-19.png","pic-23.png","pic-26.png","pic-27.png","pic-32.png","pic-33.png","pic-37.png","pic-40.png","pic-43.png","pic-55.png","pic-58.png","pic-63.png","pic-67.png","pic-69.png","pic-70.png","pic-71.png","pic-73.png","pic-74.png","pic-76.png","pic-77.png","pic-85.png","pic-90.png","pic-90.png","pic-94.png","pic-94.png","pic-97.png","pic-99.png","pic-109.png","pic-111.png","pic-117.png","pic-121.png","pic-127.png","pic-133.png","pic-139.png","pic-145.png","pic-146.png","pic-147.png","pic-148.png","pic-149.png","pic-150.png","pic-151.png","pic-152.png","pic-156.png","pic-161.png","pic-165.png","pic-171.png","pic-179.png","pic-184.png","pic-190.png","pic-196.png","pic-202.png","pic-206.png","pic-210.png","pic-217.png","pic-219.png","pic-224.png","pic-229.png","pic-233.png","pic-238.png","pic-243.png","pic-248.png","pic-252.png","pic-256.png","pic-261.png","pic-269.png","pic-273.png","pic-278.png","pic-285.png","pic-286.png","pic-288.png","pic-290.png","pic-294.png","pic-297.png","pic-302.png","pic-307.png","pic-312.png","pic-316.png","pic-321.png","pic-334.png","pic-344.png","pic-349.png","pic-355.png","pic-356.png","pic-358.png","pic-359.png","pic-360.png","pic-361.png","pic-367.png","pic-374.png","pic-375.png","pic-378.png","pic-382.png","pic-383.png","pic-383.png","pic-384.png","pic-385.png","pic-386.png","pic-386.png","pic-387.png","pic-390.png","pic-391.png","pic-392.png","pic-396.png","pic-398.png","pic-402.png","pic-408.png","pic-410.png","pic-414.png","pic-419.png","pic-424.png","pic-430.png","pic-435.png","pic-440.png","pic-445.png","pic-453.png","pic-458.png","pic-463.png","pic-468.png","pic-473.png","pic-477.png","pic-482.png","pic-487.png","pic-492.png","pic-497.png","pic-502.png","pic-507.png","pic-512.png","pic-516.png","pic-521.png","pic-525.png","pic-540.png","pic-546.png","pic-560.png","pic-569.png","pic-570.png","pic-577.png","pic-580.png","pic-581.png","pic-586.png","pic-591.png","pic-599.png","pic-600.png","pic-606.png","pic-611.png","pic-617.png","pic-621.png","pic-627.png","pic-632.png","pic-634.png","pic-636.png","pic-639.png","pic-640.png","pic-642.png","pic-647.png","pic-649.png","pic-656.png","pic-659.png","pic-661.png","pic-663.png","pic-664.png","pic-666.png","pic-667.png","pic-667.png","pic-668.png","pic-668.png","pic-669.png","pic-670.png","pic-671.png","pic-673.png","pic-674.png","pic-676.png","pic-677.png","pic-679.png","pic-681.png","pic-683.png","pic-685.png","pic-689.png","pic-691.png","pic-693.png","pic-694.png","pic-694.png","pic-695.png","pic-695.png","pic-696.png","pic-696.png","pic-697.png","pic-698.png","pic-699.png","pic-699.png","pic-700.png","pic-701.png","pic-702.png","pic-703.png","pic-710.png","pic-711.png","pic-714.png","pic-720.png","pic-731.png","pic-735.png","pic-737.png","pic-737.png","pic-738.png","pic-740.png","pic-743.png","pic-745.png","pic-745.png","pic-746.png","pic-749.png","pic-750.png"};
    public Button backbutton;
    @Override
    protected void onCreate(Bundle savedInstanceState)
    {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_jinwani);
        title = (TextView) findViewById(R.id.title);
        title.setText("Jinwani");
        ArrayList<HashMap<String, String>> menuItems = new ArrayList<HashMap<String, String>>();
        KEY_NAME = "PAGENAME";
        KEY_COST = "PAGENO";
        KEY_DESC = "IMAGE";
        jinwani = (ListView) findViewById(R.id.listView3);
        jinwani.setSelector(R.drawable.your_selecter);
        for (int i = 0; i < headings.length; i++)
        {
            HashMap<String, String> map = new HashMap<String, String>();
            map.put(KEY_NAME, headings[i]);
            map.put(KEY_COST, pages[i]);
            menuItems.add(map);
            overridePendingTransition(R.animator.right_in, R.animator.left_out);

        }
        adapter=new ListViewCustomAdapter(this, menuItems);
        //old code adapter = new ListViewCustomAdapter(this, headings, pages);
        LayoutInflater inflater = getLayoutInflater();
        ViewGroup header = (ViewGroup) inflater.inflate(R.layout.header, jinwani,
                false);

        jinwani.addHeaderView(header, null, false);

        ViewGroup footer = (ViewGroup) inflater.inflate(R.layout.footer, jinwani,
                false);

        jinwani.addFooterView(footer, null, false);
        jinwani.setAdapter(adapter);
        jinwani.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view,
                                    int position, long id) {
                System.out.println("Position:"+position);
                if(position >1) {
                    Intent in = new Intent(getApplicationContext(), subactivity.class);
                    in.putExtra("value", pics[position - 2]);
                    startActivity(in);
                    overridePendingTransition(R.animator.right_in, R.animator.left_out);
                }
            }
        });

        backbutton = (Button) findViewById(R.id.backbutton);
        backbutton.setOnClickListener(new View.OnClickListener() {
            public void onClick(View v) {
                onBackPressed();
                overridePendingTransition(R.animator.left_in, R.animator.right_out);

            }
        });



  }

    protected void onStart() {
        super.onStart();

    }
    @Override
    public void onItemClick(AdapterView<?> parent, View view, int position, long id)
    {


            Intent in = new Intent(getApplicationContext(), subactivity.class);
            in.putExtra("value", pics[position - 1]);
            startActivity(in);


    }


    @Override
    public void onBackPressed()
    {
        super.onBackPressed();
        overridePendingTransition(R.animator.left_in, R.animator.right_out);

    }
}
